ХМНПФ_Общее/Documents/уп_ПакетЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПакетЭД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ТипФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Опись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяОписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ДатаОкончанияСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсключитьПереданные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ПакетЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыКВыгрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОбъектВладелец</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭлектронныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ЭДПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ПакетЭД/Forms/уф_ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеПереключателя); 
	СвойстваПоля.Вставить("КоличествоКолонок",0); 
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ТипФайлов",Элементы.Группа1Верт,"Объект.ХМ_ТипФайлов",СвойстваПоля);	
	Элементы["ХМ_ТипФайлов"].СписокВыбора.Добавить(0,"XLS");
	Элементы["ХМ_ТипФайлов"].СписокВыбора.Добавить(1,"XML"); 
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["ХМ_ТипФайлов"],"ПриИзменении","ХМ_ТипФайловПриИзменении");
	
КонецПроцедуры

// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ТипФайловПриИзменении() // №316
&НаКлиенте
Процедура ХМ_ТипФайловПриИзменении(Элемент)
	УстановитьВидимость();
	СформироватьСписокВидовЭД();
КонецПроцедуры

// ХМНПФ 21.02.2018 КлименкоМИ // Новая ХМ_ПриОткрытии() // №1377
&НаКлиенте
Процедура ХМ_ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ВыполнитьКоманду() // №1377
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ВыполнитьКомандуНаСервере() // №1377
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ОбновитьКоманды() // №1377
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 21.10.2015 ШадринАВ // ВидЭДНачалоВыбора() // ЭДО_ОчиститьТЧ
	// ХМНПФ 22.04.2016 ШадринАВ // новый переключатель на форме "Тип файлов" // №316
	// ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДискЗавершение1() // №316
	// ХМНПФ 22.04.2016 ШадринАВ // УстановитьВидимость() // №316
	// ХМНПФ 22.04.2016 ШадринАВ // СформироватьСписокВидовЭД() // №316
	// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ТипФайловПриИзменении() // №316
	// ХМНПФ 02.08.2016 ШадринАВ // СформироватьСписокВидовЭД() // №389
	// ХМНПФ 14.11.2016 ШадринАВ // ПоДаннымСистемыФрагмент() // №646
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая ХМ_ПриОткрытии() // №1377
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ВыполнитьКоманду() // №1377
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ВыполнитьКомандуНаСервере() // №1377
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ОбновитьКоманды() // №1377
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая Подключаемый_ВыполнитьКомандуПечати() // №1377	
	// ХМНПФ 21.02.2018 КлименкоМИ // Новая ХМ_УстановитьДействияФормы() // №1377	
	// ХМНПФ 14.05.2018 КлименкоМИ // ДокументОснованиеНачалоВыбора() // №1576
	// ХМНПФ 16.05.2018 КлименкоМИ // ДокументОснованиеНачалоВыбора() // №1587
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ВидЭДНачалоВыбора")
Процедура ХМВидЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВидовЭД;
	#Вставка		
	// +ХМНПФ 21.10.2015 ШадринАВ // ВидЭДНачалоВыбора() // ЭДО_ОчиститьТЧ
	Если Объект.ДокументыКВыгрузке.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("При изменении Вида ЭД табличная часть будет очищена. Изменить Вид ЭД?", Режим);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе
			Очистить(Неопределено);
		КонецЕсли;
	КонецЕсли;
	// -ХМНПФ 21.10.2015 ШадринАВ // ВидЭДНачалоВыбора() // ЭДО_ОчиститьТЧ 
	#КонецВставки	
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ДокументОснованиеНачалоВыбора")
Процедура ХМДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Реестр3")
		ИЛИ Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Реестр5")
		ИЛИ Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Реестр6") 
		ИЛИ Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыНеУстановлены40")
		ИЛИ Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыУстановлены39") Тогда
	Иначе

		СтандартнаяОбработка = Ложь;

		СписокВидовДокументов = Новый СписокЗначений;
		Если Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Уведомление7") Тогда
			СписокВидовДокументов.Добавить(ПредопределенноеЗначение("Справочник.уп_ВидыДокументовРегистрации.СудебноеРешение"));
		Иначе	
			СписокВидовДокументов.Добавить(ПредопределенноеЗначение("Справочник.уп_ВидыДокументовРегистрации.ИзмененияЕРЗЛ"));
			#Вставка
			// +ХМНПФ 14.05.2018 КлименкоМИ // ДокументОснованиеНачалоВыбора() // №1576
			Если  Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Извещение28")
				Или Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД.Реестр1") Тогда // ХМНПФ 16.05.2018 КлименкоМИ // ДокументОснованиеНачалоВыбора() // №1587
				СписокВидовДокументов.Добавить(ПредопределенноеЗначение("Справочник.уп_ВидыДокументовРегистрации.СвидетельствоОСмерти"));
			КонецЕсли;
			// -ХМНПФ 14.05.2018 КлименкоМИ // ДокументОснованиеНачалоВыбора() // №1576
			#КонецВставки
		КонецЕсли;	

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация, Вид", Объект.Организация, СписокВидовДокументов)); 

		ОткрытьФорму("Документ.уп_ДокументРегистрации.Форма.уф_ФормаВыбора", ПараметрыФормы, Элемент,,,, Новый ОписаниеОповещения("ДокументОснованиеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ПоДаннымСистемыФрагмент")
Процедура ХМПоДаннымСистемыФрагмент()
	#Вставка		
	// +ХМНПФ 14.11.2016 ШадринАВ // ПоДаннымСистемы() // №646
	Если Объект.уп_Состояние = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.Отклонен") ИЛИ 
		Объект.уп_Состояние = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.Принят")	ИЛИ 
		Объект.уп_Состояние = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.СозданНовыйПакетЭД") Тогда		
		Если Элементы.ФормаРазрешитьРедактирование.Заголовок = "Разрешить редактирование" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Редактирование документа запрещено.";
			Сообщение.Сообщить();
			Возврат;
		Иначе
			Очистить(Неопределено);  // чтобы базу не засорять
		КонецЕсли;
	КонецЕсли;	
	// -ХМНПФ 14.11.2016 ШадринАВ // ПоДаннымСистемы() // №646
   	#КонецВставки
	
	ПоДаннымСистемыНаСервере();
	Модифицированность = Истина;

КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("СохранитьПакетНаДискЗавершение1")
Процедура ХМСохранитьПакетНаДискЗавершение1(ВыбранныеФайлы, ДополнительныеПараметры)

	ДиалогОткрытия = ДополнительныеПараметры.ДиалогОткрытия;


	Если (ВыбранныеФайлы <> Неопределено) Тогда 
		ПутьВыгрузки = ДиалогОткрытия.Каталог; 
	Иначе
		Возврат;
	КонецЕсли;

	СтруктураНастроек = уп_ЭДО.ПолучитьНастройкиМодуляЭДО(Объект.Организация, Объект.Дата);
	#Вставка		
	// +ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДискЗавершение1() // №316
	СтруктураНастроек.ТипФайлов = Объект.ХМ_ТипФайлов;
	// -ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДискЗавершение1() // №316
    #КонецВставки
	
	//определим, надо ли выгружать имеющиеся или формировать заново
	ФайлыЕсть = ложь;
	Если СтруктураНастроек.СохранятьФайлыВБД Тогда
		//файлы могут быть в базе, проверяем по строкам и описи
		Если ЗначениеЗаполнено(Объект.Опись) Тогда
			ФайлыЕсть = Истина;
		КонецЕсли;
		Для Каждого стр из Объект.ДокументыКВыгрузке Цикл
			Если ЗначениеЗаполнено(стр.ЭлектронныйДокумент) Тогда
				ФайлыЕсть = Истина;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		//+ АДаниленко 02.02.2018	
		//СформироватьФайлыНаСервере(СтруктураНастроек);	
		СохранитьПакетНаДискФрагмент(ПутьВыгрузки, СтруктураНастроек, Ложь);			
		//- АДаниленко 02.02.2018	
	КонецЕсли;

	Если ФайлыЕсть Тогда
		//спросим надо ли переформировывать
		ТекстВопроса = "Файлы сформированы и сохранены в БД. Переформировать?";
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьПакетНаДискЗавершение", ЭтотОбъект, Новый Структура("ПутьВыгрузки, СтруктураНастроек", ПутьВыгрузки, СтруктураНастроек)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;


КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("СформироватьСписокВидовЭД")
Процедура ХМСформироватьСписокВидовЭД()

	СтруктураНастроек = уп_ЭДО.ПолучитьНастройкиМодуляЭДО(Объект.Организация, Объект.Дата);
	#Вставка		
	// +ХМНПФ 22.04.2016 ШадринАВ // СформироватьСписокВидовЭД() // №316
	СтруктураНастроек.ТипФайлов = Объект.ХМ_ТипФайлов;
	// -ХМНПФ 22.04.2016 ШадринАВ // СформироватьСписокВидовЭД() // №316
	#КонецВставки
	Если СтруктураНастроек.ТипФайлов = 0 Тогда //это эксель
		СписокВидовЭД = Новый СписокЗначений;
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр1);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр2);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр3);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр4);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр5);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр6);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление8);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление10);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление12);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление13);
		#Вставка		
		// +ХМНПФ 22.04.2016 ШадринАВ // СформироватьСписокВидовЭД() // №316
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОПереданныхСуммахВДругойНПФ26);
		// -ХМНПФ 22.04.2016 ШадринАВ // СформироватьСписокВидовЭД() // №316
		// +ХМНПФ 02.08.2016 ШадринАВ // СформироватьСписокВидовЭД() // №389
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Извещение28);
		// -ХМНПФ 02.08.2016 ШадринАВ // СформироватьСписокВидовЭД() // №389
		#КонецВставки
	Иначе
		СписокВидовЭД = Новый СписокЗначений;
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр1);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр2);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр3);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр4);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр5);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реестр6);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление7);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление8);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление10);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление11);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление12);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Уведомление13);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Анкета13);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Реквизиты14);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОДоходе25);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОПереданныхСуммахВДругойНПФ26);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОНазначенииВыплаты27);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.Извещение28);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОСостоянииИЛСЗЛ29);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОВыплатах30);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОВыплатахПравопреемникам31);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыУстановлены39);
		СписокВидовЭД.Добавить(Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыНеУстановлены40);
	КонецЕсли;	                                                              

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("УстановитьВидимость")
Процедура ХМУстановитьВидимость()

	ВидЭД = Объект.ВидЭД;

	//получим настройки модуля ЭДО
	СтруктураНастроек = уп_ЭДО.ПолучитьНастройкиМодуляЭДО(Объект.Организация, Объект.Дата);
	#Вставка	
	// +ХМНПФ 22.04.2016 ШадринАВ // УстановитьВидимость() // №316
	СтруктураНастроек.ТипФайлов = Объект.ХМ_ТипФайлов;
	// -ХМНПФ 22.04.2016 ШадринАВ // УстановитьВидимость() // №316
    #КонецВставки
	
	//видимость документа основания
	Элементы.ДокументОснование.Видимость = (ВидЭД = Перечисления.уп_ВидыЭД.Реестр1 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр2 
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр3 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр5 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр6
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Уведомление7 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Уведомление11
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОПереданныхСуммахВДругойНПФ26
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Извещение28 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОСостоянииИЛСЗЛ29
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыНеУстановлены40 
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыУстановлены39);

	//видимость уведомления
	Элементы.Уведомление.Видимость = (ВидЭД = Перечисления.уп_ВидыЭД.Реестр4);

	ВидимостьСуммыВРеестре = (ВидЭД = Перечисления.уп_ВидыЭД.Уведомление8);

	////Элементы.ГруппаСтраницыТипДокумента.Видимость = Истина;
	//
	//Если ВидЭД = Перечисления.уп_ВидыЭД.Реквизиты14 Тогда
	//	//Элементы.ГруппаСтраницыТипДокумента.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчет;
	//ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.Анкета13 Тогда
	//	//Элементы.ГруппаСтраницыТипДокумента.Видимость = Ложь;
	//ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.СведенияОДоходе25 Тогда
	//	//Элементы.ГруппаСтраницыТипДокумента.ТекущаяСтраница = Элементы.Доход;
	//Иначе
	//	Если ВидимостьПлатежныхДокументов Тогда
	//		//Элементы.ГруппаСтраницыТипДокумента.ТекущаяСтраница = Элементы.РеестрИПлатежки;
	//	Иначе
	//		//Элементы.ГруппаСтраницыТипДокумента.ТекущаяСтраница = Элементы.Реестр;
	//	КонецЕсли;	
	//КонецЕсли;


	//видимость панели платежных документов
	ВидимостьПлатежныхДокументов = (ВидЭД = Перечисления.уп_ВидыЭД.Реестр1 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр2
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр3  ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр4  
	ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр5 ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.Реестр6);

	ВидимостьРеестр 			 = (НЕ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОДоходе25 И НЕ ВидЭД = Перечисления.уп_ВидыЭД.Реквизиты14
	И НЕ ВидЭД = Перечисления.уп_ВидыЭД.Анкета13);

	Элементы.Коэффициент.Видимость 			= (ВидЭД = Перечисления.уп_ВидыЭД.СведенияОДоходе25);
	Элементы.РасчетныйСчет.Видимость 		= (ВидЭД = Перечисления.уп_ВидыЭД.Реквизиты14);
	Элементы.ГруппаРеестрДата.Видимость 	= ВидимостьРеестр;
	Элементы.ГруппаРеестр2.Видимость 	    = ВидимостьРеестр И НЕ ВидимостьПлатежныхДокументов;
	Элементы.ДокументЗаполнения.Видимость   = ВидимостьРеестр И ВидимостьПлатежныхДокументов;
	Элементы.ЭлектронныеДокументы.Видимость = ВидимостьРеестр;
	Элементы.ПлатежныеДокументы.Видимость   = ВидимостьРеестр И ВидимостьПлатежныхДокументов;
	Элементы.Переключатель.Видимость        = (ВидЭД = Перечисления.уп_ВидыЭД.СведенияОВыплатах30);
	//+ АДаниленко 22.01.2018	
	Элементы.уп_ДатаОкончанияСВ.Видимость   = ВидЭД = Перечисления.уп_ВидыЭД.СведенияОНазначенииВыплаты27;
	//- АДаниленко 22.01.2018	

	Элементы.ПлатежныеДокументы.ВысотаВСтрокахТаблицы = ?(ВидимостьПлатежныхДокументов, 4, 0);

	Элементы.ЭлектронныеДокументыСумма.Видимость = ВидимостьСуммыВРеестре;

	//видимость панели описи
	Элементы.Опись.Видимость    = СтруктураНастроек.СохранятьФайлыВБД;
	Элементы.ИмяОписи.Видимость = НЕ СтруктураНастроек.СохранятьФайлыВБД;

	//видимость панели пенсионный фонд
	Элементы.СтраницыПенсионныйФонд.Видимость = Истина;
	Если ВидЭД = Перечисления.уп_ВидыЭД.Извещение28 
		ИЛИ ВидЭД = Перечисления.уп_ВидыЭД.СведенияОПереданныхСуммахВДругойНПФ26 Тогда
		Элементы.СтраницыПенсионныйФонд.ТекущаяСтраница = Элементы.СтраницаПФ;
	ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.Уведомление7 Тогда
		Элементы.СтраницыПенсионныйФонд.ТекущаяСтраница = Элементы.СтраницаИнвестиционныйПортфель;
	ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.Уведомление8 Тогда
		Элементы.СтраницыПенсионныйФонд.ТекущаяСтраница = Элементы.СтраницаУведомление8;
	ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыУстановлены39 Тогда
		Элементы.СтраницыПенсионныйФонд.ТекущаяСтраница = Элементы.СтраницаСведения39;
	ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыНеУстановлены40 Тогда
		Элементы.СтраницыПенсионныйФонд.ТекущаяСтраница = Элементы.СтраницаСведения40;
	Иначе
		Элементы.СтраницыПенсионныйФонд.Видимость = Ложь;
	КонецЕсли;

	//видимость имен файлов в табличных частях
	Элементы.ЭлектронныеДокументыЭлектронныйДокумент.Видимость   = СтруктураНастроек.СохранятьФайлыВБД;
	Элементы.ЭлектронныеДокументыИмяДокумента.Видимость          = НЕ СтруктураНастроек.СохранятьФайлыВБД;

	//Элементы.ЭлектронныеДокументыПлЭлектронныйДокумент.Видимость = СтруктураНастроек.СохранятьФайлыВБД;
	//Элементы.ЭлектронныеДокументыПлИмяДокумента.Видимость        = НЕ СтруктураНастроек.СохранятьФайлыВБД;
	//+ АДаниленко 02.10.2018	
	Элементы.ЗаГод.Видимость = ВидЭД = Перечисления.уп_ВидыЭД.СведенияОРезультатахИнвестированияВыплатыНеУстановлены40 И Объект.ПорядокОтраженияРезультатаИнвестирования = 0;
	//- АДаниленко 02.10.2018

КонецПроцедуры


&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	ХМ_ПриОткрытии(Отказ);
КонецПроцедуры
